#include<hspos.h>

/****************************************************************************
函数名称: str_to_hex
函数功能: 字符串转换为十六进制
输入参数: string 字符串 cbuf 十六进制
输出参数: 无
*****************************************************************************/
void toHex(unsigned char *src,unsigned char *hex);

/****************************************************************************
函数名称: swap
函数功能: 高低字节交换 
输入参数: src 字符串
输出参数: 无
*****************************************************************************/
int swap(unsigned char *buffer);

/****************************************************************************
函数名称: toShort
函数功能: 字节转换成短整型 
输入参数: buffer 字符串
输出参数: short
*****************************************************************************/
short toShort(unsigned char *buffer);
